In [8]:
import pandas as pd

In [9]:
india_weather = {
    "city":["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity":[80,60,78]
}

In [10]:
india_weather

{'city': ['mumbai', 'delhi', 'banglore'],
 'temperature': [32, 45, 30],
 'humidity': [80, 60, 78]}

In [11]:
india_weather = pd.DataFrame(india_weather)
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [12]:
us_weather = {
    "city": ["new york","chicago","orlando"],
    "temperature":[21,14,35],
    "humidity":[68,65,75]
}
us_weather

{'city': ['new york', 'chicago', 'orlando'],
 'temperature': [21, 14, 35],
 'humidity': [68, 65, 75]}

In [14]:
us_weather = pd.DataFrame(us_weather)
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [16]:
df = pd.concat([india_weather,us_weather], ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [17]:
df = pd.concat([india_weather,us_weather], keys=["india","usa"])
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
usa   0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [23]:
usa_data = df.loc["usa"]
usa_data

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

# Add two data axis:

In [30]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "windspeed":[32,45,30]
})
temperature_df

       city  windspeed
0    mumbai         32
1     delhi         45
2  banglore         30

In [31]:
windspeed_df = pd.DataFrame({
    "city":["mumbi","delhi","banglore"],
    "windspeed": [7,12,9]
})
windspeed_df

       city  windspeed
0     mumbi          7
1     delhi         12
2  banglore          9

In [33]:
new_df = pd.concat([temperature_df,windspeed_df],axis=1)
new_df

       city  windspeed      city  windspeed
0    mumbai         32     mumbi          7
1     delhi         45     delhi         12
2  banglore         30  banglore          9